'''1. Напишіть програму, яка отримує три цілих числа, введені з клавіатури (кожне число вводиться на окремому рядку), і друкує на екрані
     їх суму, добуток, результат піднесення першого числа до степеня різниці другого і третього чисел.
     Вхідні дані: 2, 3, 6
'''
'''
x1 = int(input("Введіть 1-ше число: "))
x2 = int(input("Введіть 2-ге число: "))
x3 = int(input("Введіть 3-є число: "))
print(f"Сума = {x1+x2+x3}")
print(f"Добуток = {x1*x2*x3}")
print(f"{x1}^({x2}-{x3}) = ({x1**(x2-x3)})")
'''

'''2. Напишіть програму, яка приймає ціле число n і обчислює значення виразу n + nn + nnn.
Вхідні дані: 5; 3; 1
'''
'''
n = int(input("Введіть ціле число: "))
a = str(n)
nn = int(a+a)
nnn = int(a+a+a)
print(f"{n+nn+nnn}")
'''

'''3. Напишіть програму, яка отримує такі дані: ім’я, вік, хобі, введені з клавіатури (вводяться на окремих рядках), і друкує на екрані
     одним повідомленням повну інформацію на основі введених даних.
     Вхідні дані: Lord Voldemort, 72, Magic
'''
'''
name = input("Введіть ім'я: ")
age = input("Введіть вік: ")
hobby = input("Введіть захоплення: ")
print(f"Моє ім'я - {name}. Мені {age} роки(-ів), а моє захоплення - {hobby}.")
'''

'''4. Напишіть програму, яка зчитує довжину основи та висоту прямокутного трикутника (цілі числа), обчислює площу і друкує її значення
      на екрані у відформатованому вигляді (два символи після десяткової крапки). Кожен параметр вводиться на окремому рядку.
     Вхідні дані: 3; 4.
'''
'''
a = int(input("Введіть довжину основи пямокутного трикутника: "))
h = int(input("Введіть висоту прямокутного трикутника: "))
print(f"S={0.5*a*h:.2f}")
'''

'''5. Напишіть програму, яка зчитує ціле число, і друкує попереднє та наступне числа відносно введеного.
Вхідні дані: 179.
'''
'''
z = int(input("Введіть число: "))
print(f"Число наступне за числом {z} це {z+1}, а попереднє - {z-1}")
'''

'''6. Вводиться ціле додатне число. Надрукуйте останню цифру числа.
     Вхідні дані: 179; 40; 101.
'''
'''
x = str(input("Введіть ціле додатнє число: "))
print(x[-1:])
'''

'''7. Напишіть програму, яка друкує на екрані наступне повідомлення: Hello, Starlink subscriber! Your current balance is 125.56 UAH. Назва стільникової мережі і
      значення балансу вводиться з клавіатури.
     Вхідні дані: Starlink; 4425.
'''
'''
name = input("Введіть назву Вашої стільникової мережі: ")
bal = float(input("Введіть Ваш баланс: "))
print(f"Hello, {name} subscriber! Your current balance is {bal:.2f} UAH")
'''

'''8. Напишіть програму, яка приймає ім’я та прізвище від користувача у різних рядках та роздруковує їх у зворотному порядку з пропуском між ними у вітальному
      повідомленні.
     Вхідні дані: Gordon, Freeman.
'''
'''
f_name = input("введіть Ваше ім'я: ")
l_name = input("Введіть Ваше прізвище: ")
print(f"Здравствуйте, {l_name} {f_name}!")
'''

'''Далі задачі від викладача GoIt'''

'''Блок Задач №1 Решение задач по формулам:'''

'''Задача 1.
Составить программу решения линейного уравнения а*х + b = 0 (а≠0). (a и b вводятся пользователем)'''
'''
print("ax+b=0")
a = float(input("Введіть 'a': "))
b = float(input("Введіть 'b': "))
x = - b/a
print(f"{a}x+{b}=0  => x={x}")
'''

'''Задача 2.
Составить программу вычисления площади и гипотенузы прямоугольного треугольника, если известны его катеты (вводятся пользователем)'''
'''
print("c^2=a^2+b^2")
a = int(input("Введіть довжину катету 'a': "))
b = int(input("Введіть довжину катету 'b': "))
c = (a**2+b**2)**0.5
S = 0.5*a*b
print(f"У прямокутному трикутнику гіпотенуза c={c}, а площа S={S}")
'''

'''Задача 3.
Дана сторона квадрата a (вводится пользователем). Составить программу нахождения его периметра.'''
'''
a = int(input("Введіть довжину сторони квадрата 'a': "))
print(f"Периметр кадрата P={a*4}, а його площа S={a*a}")
'''

'''Задача 4.
Дан радиус окружности r (вводятся пользователем). Составить программу нахождения длины окружности и площадь круга'''
'''
r = float(input("Введіть радіус кола 'r': "))
print(f"Довжина кола L={2*math.pi*r:.3f}, а його площа S={math.pi*r*r:.3f}")
'''

'''Задача 5.
Составить программу вычисления суммы модулей трех вещественных чисел'''
'''
a = float(input("Введите первое число 'a': "))
b = float(input("Введите второе число 'b': "))
c = float(input("Введите третье число 'c': "))
print(f"Сума модулів трьох дійсних чисел дорівнює {abs(a)+abs(b)+abs(c)}")
'''

'''Задача 6
Дано вещественное число х. Составить программу нахождения значения выражения  2x^4−3x^3+4x^2−5x+6'''
'''
x = float(input("Введіть дійсне число 'x': "))
print(f"При x={x} : 2x^4−3x^3+4x^2−5x+6={2*(x**4)-3*(x**3)+4*(x*x)-5*x+6:.2f}")
'''

'''Задача 7
Составить программу вычисления расстояния между точками с координатами, которые вводятся пользователем.'''
'''
x1 = float(input("Введіть значення абсциси першої точки: "))
y1 = float(input("Введіть значення ординати першої точки: "))
x2 = float(input("Введіть значення абсциси другої точки: "))
y2 = float(input("Введіть значення ординати другої точки: "))
print(f"Відстань між точками ({x1};{y1}) та ({x2};{y2} становить {((x2-x1)**2+(y2-y1)**2)**0.5:.2f})")
'''

'''Блок задач №2. Решение задач на определение цифр числа'''

'''Задача 8
Составить программу, которая вводит с клавиатуры четырехзначное число и выводит на экран среднее арифметическое его цифр.'''
'''
x = int(input("Введіть чотирьохзначне число: "))
x4 = x % 10
x3 = x // 10 % 10
x2 = x // 100 % 10
x1 = x // 1000 % 10
print(f"Середнє арифметичне цифр введеного числа становить {(x1+x2+x3+x4)/4}")
'''

'''Задача 9
Составить программу которая вводит с клавиатуры трехзначное число и выводит на экран
     сумму последней и предпоследней цифры
     сумму последней и первой цифры.'''
'''
x = int(input("Введіть трьохзначне число: "))
x1 = x // 100 % 10
x2 = x // 10 % 10
x3 = x % 10
print(f"Сума останньої та передостанньої цифр становить {x2+x3}")
print(f"Сума пертшої та останньої цифр становить {x1+x3}")
'''

'''Задача 10
В трехзначном числе х зачеркнули его вторую цифру. Когда к образовавшемуся двузначному числу слева приписали вторую цифру числа х, то получилось число y. 
     Составить программу нахождения числа y.'''
'''
x = int(input("Введіть трьохзначне число: "))
x1 = x // 100 % 10
x2 = x // 10 % 10
x3 = x % 10
y = int(str(x2)+str(x1)+str(x3))
print(f"Шукане число y={y}")
'''

'''Задача 11
Результат поиска сгенерировал n записей (вводится пользователем). Сколько страниц потребуется для отображения этих записей, если на 1 страницу выводится 10 записей.'''
'''
n = int(input("Введіть кількість записів, що згенерував пошук: "))
if n % 10 == 0:
    print(f"Для відображення всіх записів потрібно {n//10} сторінок(-ка/ки).")
else:
    print(f"Для відображення всіх записів потрібно {n//10+1} сторінок(-ка/ки).")
'''

'''Блок задач №3. Работа с деньгами и временем.'''

'''Задача 12
Составить программу, которая переводит время из секунд, определяя полное количество часов минут и секунд 
     (например, время 5000 секунд это 1 час 23 минуты 20 секунд 5000=13600+2360+20).'''
'''
sec = int(input("Введіть к-ть секунд: "))
h = sec // 3600
m = (sec - h * 3600) // 60
s = sec - h * 3600 - m * 60
print(f"{sec} секунд це {h} годин(-а) {m} хвилин(-а/и) {s} секнунд(-а)")
'''

'''Задача 13
В Интернет-магазине сделано 4 покупки: на $34.34, $12.01, $17.42, $4.93. Из скольки долларов и центов будет состоять итоговая сумма.'''
'''
p1 = float(input("Введіть вартість 1-ї покупки "))
p2 = float(input("Введіть вартість 2-ї покупки "))
p3 = float(input("Введіть вартість 3-ї покупки "))
p4 = float(input("Введіть вартість 4-ї покупки "))
sum = p1 + p2 + p3 + p4
print(f"Вартість покупки в гривнях складає {int(sum)} грн")
print(f"")
'''

'''Задача 14
Составить программу определения номера подъезда и этажа квартиры по заданному номеру квартиры. В доме 5 этажей и 4 квартиры на этаже.'''
'''
n = int(input("Введіть номер квартири: "))
x = int(input("Введіть к-ть поверхів в будинку: "))
y = int(input("Введіть к-ть квартир на поверсі: "))
p = (n - 1) // (x * y) + 1
e = n % (x * y) // y + 1
print(f"Квартира №{n} розташована в {p}-му під'їзді на {e}-му поверсі")
'''

'''Задача 15
Составить программу определения номера столетия с по номеру  n(n>0)  некоторого года (учесть что к примеру, началом 20 века был 1901, а не 1900 год).'''
'''
n = int(input("Введіть рік: "))
s=(n-1)//100+1
print(f"{n} рік належить до {s}-го століття")
'''

'''Задача 16
Для кофе-брейков на конференции закуплено: х круассанов, у стаканчиков, z упаковок кофе. Цена круасана $1.04, цена стаканчика - $0.34, 
     цена упаковки кофе $4.42 Составить программу вычисляющую, сколько полных долларов ушло на закупку еды для кофе-брейков, и какова его стоимость в центах.'''
'''
x = int(input("Введіть кількість закуплених круасанів: "))
y = int(input("Введіть кількість закуплених стаканчиків: "))
z = int(input("Введіть кількість закуплених упаковок кави: "))
p_x = 1.04
p_y = 0.34
p_z = 4.42
summa = x * p_x + y * p_y + z * p_z
print(f"На закупівлю {x} круасанів, {y} стаканчиків, {z} упаковок кави витратили {int(summa)} доларів, а в центах - {summa * 100} центів")
'''

'''Код з Модуля 2'''
'''
def string_to_codes(string: str) -> dict:
    # Ініціалізація словника для зберігання кодів
    codes = {}  
    # Перебір кожного символу в рядку
    for ch in string:  
        # Перевірка, чи символ вже є в словнику
        if ch not in codes:
            # Додавання пари символ-код в словник  
            codes[ch] = ord(ch)  
    return codes
abc = str(input("Ведіть текст: "))
result = string_to_codes(abc)
print(result)
'''

'''
def outer_func():
    enclosing_var = "Я змінна в функції, що охоплює"
    def inner_func():
        print("Всередині вкладеної функції:", enclosing_var)
    inner_func()
outer_func()
'''

'''
def func_outer():
    x = 2
    def func_inner():
        nonlocal x
        x = 5
    func_inner()
    return x
result = func_outer()
print(result)
'''

'''
x = 50
def func():
    global x
    print('x дорівнює', x)
    a = input("Ведіть нове значення змінної: ")
    x = a
    print('Змінюємо глобальне значення x на', x)
func()
print('Значення x складає', x)
'''

'''
def say(message, times=1):
    print(message*times)
say('Світ', 5)
'''

'''
def real_cost(base: int, discount: int = 0) -> int:
    return base * (1 - discount)
price_bread = int(input("Введіть вартість хліба: "))
price_butter = int(input("Введіть вартість масла: "))
price_sugar = int(input("Введіть вартість цукру: "))
current_price_bread = real_cost(price_bread)
current_price_butter = real_cost(price_butter, 0.05)
current_price_sugar = real_cost(price_sugar, 0.07)
print(f'Нова вартість хліба: {current_price_bread}')
print(f'Нова вартість масла: {current_price_butter}')
print(f'Нова вартість цукру: {current_price_sugar}')
'''

'''
def concatenate(*args) -> str:
    result = ""
    for arg in args:
        result += arg
    return result
print(concatenate("Hello", " ", "world", "!"))
'''

'''
def greet(**kwargs):
    for key, value in kwargs.items():
        print(f"{key}: {value}")
greet(name="Alice", age=25)
'''

'''
def example_function(*args, **kwargs):
    print("Позиційні аргументи: ", args)
    print("Ключові аргументи: ", kwargs)
example_function(1, 2, 3, name='Alice', age=25)
'''

'''
def greet(name, age):
    print(f"Hello {name}, you are {age} years old.")
person_info = {"name": "Alice", "age": 25}
greet(**person_info)
'''

'''
x = int(input())
def factorial(n):
    if n == 0: # базовий випадок
        return 1
    else:
        return n * factorial(n-1) # рекурсивний випадок
def fibonacci(n):
    if n <= 1 : # базовий випадок
        return n
    else:
        return fibonacci(n-1) + fibonacci(n-2) # рекурсивний випадок

print(f"{x}! = {factorial(x)}")
print(f"{x}-ий член послідовності Фібоначчі - {fibonacci(x)}")
'''

'''Послідовність чисел Фібоначчі'''
'''
n = int(input("Введіть к-ть чисел Фібоначчі, що потрібно вивести: "))
fib = [0, 1]
i = 3
a = 0
b = 1
if n == 1 :
    print(f"[{fib[0]}]")
elif n == 2 :
    print(fib)
else:
    while i < n + 1 :
        s = a + b
        fib.append(s)
        a = b
        b = s
        i += 1
    print(fib)
'''

'''
def factorial(n):
    print("Виклик функції factorial з n = ", n)
    if n == 1:
        print("Базовий випадок, n = 1, повернення 1")
        return 1
    else:
        result = n * factorial(n-1)
        print("Повернення результату для n = ", n, ": ", result)
        return result
x = int(input("n="))
print(f"n!={factorial(x)}")
'''

'''
num = int(input("Enter the integer (0 to 100): "))
sum = 0
while num > 0:
    sum += num
    num -= 1
print(sum)
'''

'''
message = "Never argue with stupid people, they will drag you down to their level and then beat you with experience."
search = "r"
result = 0
for simb in message:
    if simb == search:
        result += 1
print(result)
'''

'''
def discount_price(price, discount):
    def apply_discount():
        nonlocal price
        price = price * discount
    apply_discount()    
    return price
print(discount_price(15.45, 0.5))
'''

...
