'''print("Задача 1.1 'Прямокутник")
a = int(input("Введіть довжину а: "))
b = int(input("Введіть довжину b: "))
p = (a + b) * 2
s = a * b
print(f"У прямокутника зі сторонами {a}см та {b}см периметр P={p}см й площа S={s}см^2")'''

'''print("Задача1. 2 'Щасливий квиток'")
c = list(input("Введіть шестизначне число: "))
if (int(c[0])+int(c[1])+int(c[2])) == (int(c[3])+int(c[4])+int(c[5])):
    print(f"Ваш квиток з номером {c[0]}{c[1]}{c[2]}{c[3]}{c[4]}{c[5]} є щасливим. Вітаємо!")
else:
    print(f"Нажаль, Ваш квиток з номером {c[0]}{c[1]}{c[2]}{c[3]}{c[4]}{c[5]} не э щасливим.")'''

print("Задача 2.1 'Обернене число'")
